""" Userbot module for having some fun with people. """
import asyncio
import random

from telethon.tl.functions.users import GetFullUserRequest
from telethon.tl.types import MessageEntityMentionName

from userbot import catub

from . import ALIVE_NAME

DEFAULTUSER = str(ALIVE_NAME) if ALIVE_NAME else "SurCat"
SURID = bot.uid

plugin_category = "fun"
# ================= CONSTANT =================
RUNSREACTS = [
    "`Idhula enna perumai🤨`",
    "`😜Nee enna avlo periya Appatukera ah 😌😜`",
    "`Nee Poi Love Sonna Paravala. Neeye Vedikathan Paarka Pora😎😎😎`",
    "`nee vaangura indha anju paththu pichaiku, idhu thevathaanaa?`”,
    "`Naalu Perukku Nallathunnaa  Ethuvume Thappilla`",
    "`Vera Vela Iruntha Paaruya`",
    "`Avar Enna Echakalai Egambaramnnu Ninaichiya`",
    "`Padikkaadha Muttalnnuthana Padichi Padichi Sonnen`",
    "`Ennaivida Adhigama Sambadhikkara Thimira.`",
    "`Nī rattam kakki taṉ cava😡`",
    "`Dey Annan Sigappu Da Sattaiya Parthiya?💂‍♀`",
    "`Poda panni 🐖 `",
    "`Mandaiya Udaichiruven Poya`",
    "`Pesurathai Paatha Ore Dialouge Ah Than Oorukkulla Sollikittu Thiriyira Polirukku`",
    "`Athukku Peru Than Dubakoor`",
    "`Pathai Vaangittu Oodi Poyidu`",
    "`Kevalam Oru Pichaikkaariyai Kooda Vittu Vaikkalaiya`",
    "`Adapaavi Un Mogaraiyai Muzhusa Kooda Paakkalaiye Da`",
    "`Nee Varama Irukurathu Than Enakku Safety`",
    "`Oorama Nillu`",
    "`Ennaya Arivu Ketta Thanama Pesikitu Irukka😶`",
    "`അല്ല ഇതാര് വാര്യംപിള്ളിയിലെ മീനാക്ഷി അല്ലയോ... എന്താ മോളെ സ്കൂട്ടറില്....🙈 `",
    "`മോന്തയ്ക്കിട്ട് കൊടുത്തിട്ട് ഒന്ന് എടുത്ത് കാണിച്ചുകൊടുക്ക് അപ്പോൾ കാണും ISI മാർക്ക് 😑 `",
    "`ഇട്ടിട്ട് പോകില്ലെന്ന് ഉറപ്പുള്ള പെണ്ണ്  🤰🤱👩👦 ”`",
    "`ദൈവമേ എന്നെ മാത്രം രക്ഷിക്കണേ....⛪ `",
    "`ഇത് കണ്ണോ അതോ കാന്തമോ...👀 `",
]

RAPE_STRINGS = [
    "`വേലക്കാരി ആയിരുന്താലും നീ എൻ മോഹവല്ലി....🥰`",
    "`ഭവാനി ഒന്നു മനസ്സ് വെച്ചാൽ ഈ കലവറ നമുക്ക് മണിയറ ആക്കാം.....🥰🥰`",
    "`ഒരു മുത്തം തരാൻ പാടില്ല എന്നൊന്നും അന്റെ ഉപ്പാപ്പ പറഞ്ഞിട്ടുണ്ടാവില്ലല്ല....🥰😜`",
    "`ശോഭേ ഞാനൊരു വികാര ജീവിയാണ് 😜😜🥰😂 `",
    "`നിനക്കെന്നെ പ്രേമിച്ചൂടെ കൊച്ചേ 😜😜`",
    "`എങ്കിലേ എന്നോട് പറ ഐ ലവ് യൂന്ന് 🥰🥰🥰 `",
    "`പോരുന്നോ എന്റെ കൂടെ 🥰🥰 `",
    "`എനിക്ക് നിന്റെ പുറകിൽ നടക്കാനല്ല, ഒപ്പം നടക്കാനാണ് ഇഷ്ടം 🥰😍`",
    "`ഓളാ തട്ടമിട്ടു കഴിഞ്ഞാലെന്റെ സാറേ, പിന്നെ ചുറ്റുമുള്ളതൊന്നും കാണാൻ പറ്റൂല്ലാ 😍🥰`",
]
THANOS_STRINGS = [
    "`തെറി കേട്ടിട്ട് ഇവളുടെ വീട് കൊടുങ്ങല്ലൂർ ഭാഗത്താണെന്ന് തോന്നുന്നു...😜😜`",
    "`പുന്നാര മോളേ😜😜🤭 `",
    "`ചങ്ക് പറിച്ചു തരുന്ന ചങ്കത്തി കൂടെയുള്ളപ്പോൾ പിന്നെന്തിനാ ലവർ 🥰😜 `",
    "`ഇവൾ നമ്മളേക്കാൾ തറയാടാ...😂😂🤭`",
    "`അഹങ്കാരത്തിന് കയ്യും കാലും വെയ്ക്കാ... എന്നിട്ട് പെണ്ണെന്നു പേരും...🤣🤣😜`",
    "`ആനി മോനെ സ്നേഹിക്കുന്ന പോലെ , മാഗ്ഗിക്ക് എന്നെ സ്നേഹിക്കാമോ...🥰🥰😘`",
    "`അല്ല ഇതാരാ ! വാര്യംപള്ളിയിലെ മീനാക്ഷിയല്ലയോ ? എന്താ മോളേ സ്കൂട്ടർല്...😜😜🤣`",
]
ABUSEHARD_STRINGS = [
    "`നിന്റെ പേരെന്താന്നാ പറഞ്ഞെ -പൈലി ഡ്രാഗൺപൈലി ഡ്യൂഡ് സാറെന്ന്യല്ലേ പേരിട്ടത്.. എന്തൂള പേരാടാത് അയ്യേ...😛😛😜`",
    "`ദാമോദരൻ ഉണ്ണി മകൻ ദിൽമൻ ഇടക്കൊച്ചി, പീപ്പിൾ കാൾ മീ ഡ്യൂഡ് 😎😎🤨 `",
    "`മധ്യതിരുവിതാംകൂർ ഭരിച്ച രാജാവാ പേര് ശശി.. 😛😂🤣 `",
    "`തീരുമ്പോ തീരുമ്പോ പണി തരാൻ ഞാനെന്താ കുപ്പീന്ന് വന്ന ഭൂതോ... 😇😇🙄`",
    "`ഒന്ന് മിണ്ടാതിരിക്കുവോ.. എന്റെ കോൺസെൻട്രേഷൻ പോണ്.. ദേ ആയുധം വെച്ചുള്ള കളിയാ 😝😝😂`",
    "`സൂക്ഷിച്ചു നോക്കണ്ടടാ ഉണ്ണീ ഇത് ഞാനല്ല...😇🤣🤣`",
    "`ഈ യന്ത്രങ്ങളുടെ പ്രവർത്തനമൊന്നും താനെന്നെ പഠിപ്പിക്കേണ്ട ഞാനേ പോളിടെക്‌നിക് പഠിച്ചതാ 😎😎😝 `",
    "`ഡിങ്കോൾഫി അല്ലേ ഇത്രക്ക് ചീപ്പാണോ അര്ടിസ്റ്റ് ബേബി😉😉😜 `",
    "`ആദ്യമായി പ്രേമിച്ച പെണ്ണും ആദ്യമായി അടിച്ച ബ്രാൻഡും ഒരാളും ഒരു കാലത്തും മറക്കില്ല്യ😜😜😎`",
    "`ഡാ മോനേ അത് ലോക്കാ ഇങ്ങ് പോര്.. ഇങ്ങ് പോര്..😇😇🤭`",
    "`അടിച്ചതാരാടാ നിന്നെ ആണ്ടവനോ സേഡ്‌ജിയോ അടിച്ചതല്ല ചവിട്ടിയതാ ഷൂസിട്ട കാലുകൊണ്ട് 🤭🤭🤭`",
    "`വസൂ... ദേ തോറ്റു തുന്നം പാടി വന്നിരിക്കുന്നു നിന്റെ മോൻ...🤭🤭😜`",
    "`വോ ലമ്പേ.... വോ ബാത്തേ.... കോഴീ ന ജാനേ.... ങേ കോഴിയോ 🐓🐓🐓`",
    "`എന്താ? പെൺകുട്ടികൾക്കിങ്ങനെ സിമ്പിൾ ഡ്രെസ് ധരിക്കുന്ന പുരുഷന്മാരെ ഇഷ്ടമല്ലേ ? ഡോണ്ട് ദെ ലൈക് ?😎😜`",
    "`ലേലു അല്ലു ലേലു അല്ലു ലേലു അല്ലു അഴിച്ചു വിട് 🤣🤣`",
    "`ഇതെന്താ , എനിക്കുമാത്രം പ്രാന്തായതാണോ അതോ നാട്ടുകാർക്ക് മൊത്തത്തിൽ പ്രാന്തായോ ?😇😇🤣`",
    "`അങ്ങനെ പവനായി ശവമായി.. എന്തൊക്കെ ബഹളമായിരുന്നു.. മലപ്പുറം കത്തി, മെഷീൻഗണ്ണു, ബോംബ്, ഒലക്കേടെ മൂട്...🤭🤣🤣`",
]

PRO_STRINGS = [
    "`ഡാ മങ്കി മാങ്ങാതലയാ 😜`",
    "`വല്യ മലരനാണല്ലോടാ നീ`",
    "`പോയി ചാവടാ കള്ള പന്നീ`",
    "`പോയി തൊലയെടാ തവളാച്ചി മോറാ😜 `",
    "`മാറിപ്പോടാ മരം കൊത്തി മോറാ😜`",
    "`പുന്നാര മോനേ പോയി ചത്തൂടെ നിനക്ക് 😜`",
    "`നീ പോടാ കാട്ടുകോഴീ😜`",
    "`കോപ്പേ വല്യ ബഹളം വേണ്ട😜`",
    "`പുന്നാര മോനേ 😜`",
    "`പ്ഫാ ഇറങ്ങി പോടാ മാക്രി 😜`",
    "`നിന്റെ പെട്ടീം കെടക്കേം എടുത്ത് ഇപ്പോ ഇറങ്ങിക്കോണം ഇവിടുന്ന് `",
    "`ഇനി നീ വാ തുറന്നാൽ മണ്ണ് വാരി ഇടും 😜`",
    "`അടിച്ചു നിന്റെ മണ്ട പൊളിക്കും കേട്ടോടാ മരപ്പട്ടീ... 😡😜`",
    "`മത്തങ്ങാ തലയാ 😜`",
    "`മാങ്ങാണ്ടി മോറാ 😜`",
]

SLAP_TEMPLATES = [
    "[{user1}](tg://user?id={SURID}) {victim} ന്റെ തലക്ക് ഒലക്ക കൊണ്ട് അഞ്ചാറു അടി കൊടുത്തു 😪😪 .",
    "[{user1}](tg://user?id={SURID}) ചാണകം വാരി {victim} ന്റെ മോന്തക്ക് എറിഞ്ഞു 🤢🤮 .",
    "️[{user1}](tg://user?id={SURID}) ഓടി വന്ന് {victim} ന്റെ തലയിൽ ചീമുട്ടയെറിഞ്ഞു 🤭🤭😜.",
    "[{user1}](tg://user?id={SURID}) ️{victim} നെ കാലേ വാരി നിലത്തടിച്ചു 🤓☹️",
    "️[{user1}](tg://user?id={SURID}) വലിയ പാറക്കല്ലെടുത്തു {victim} ന്റെ തലക്കെറിഞ്ഞു 😱😱🤭 .",
    "[{user1}](tg://user?id={SURID}) {victim} നെ വിളിച്ചോണ്ട് പോയി പൊട്ടകിണറ്റിൽ തള്ളിയിട്ടു 🤗🤗😝 .",
    "️[{user1}](tg://user?id={SURID}) കാക്കയെ വിളിച്ചു വരുത്തി {victim} ന്റെ തലയിൽ അപ്പിയിടീച്ചു 😝🤣 .",
    "[{user1}](tg://user?id={SURID}) ഓടി വന്ന് ചൂരൽ കൊണ്ട് {victim} ന്റെ ചന്തിക്കിട്ട് അഞ്ചാറു അടി കൊടുത്ത് 😂😜 .",
    "[{user1}](tg://user?id={SURID}) {victim} നെ കൊതുകിനെ കൊല്ലുന്ന പോലെ അടിച്ചു കൊന്നു 🤭😜.",
    "️[{user1}](tg://user?id={SURID}) കോഴിക്കാഷ്ടം എടുത്ത് {victim} ന്റെ മുഖത്തു തേച്ചു 🤭🤣.",
    "[{user1}](tg://user?id={SURID}) {victim} നെ എടുത്തോണ്ട് പോയി ചാണകക്കുഴിയിലിട്ടു 🤣🤣😛.",
    "️[{user1}](tg://user?id={SURID}) പട്ടിയെ അഴിച്ചു വിട്ട് {victim} ന്റെ ചന്തിയിൽ കടിപ്പിച്ചു 😂😂😛.",
    "[{user1}](tg://user?id={SURID}) കട്ടുറുറുമ്പിനെകൊണ്ട് {victim} ന്റെ കുണ്ടിക്ക് കടിപ്പിച്ചു 🤭🤭😜",
    "[{user1}](tg://user?id={SURID}) {victim} നെ കോഴിയാണെന്ന് കരുതി കൂട്ടിലടച്ചു 🤭🤭😜",
]

JOKE_STRINGS = [
   "Which is the only dancing animal? \n Yosinga! \n Theriyalaya? \n AADU..!",
   "500 rupees note la Ghandhi yen sirichitte irukkar ? A: Yenna Alutha nanainjudume !!!",
   "Bus mela nee earinaalum sari, un mela bus earinaalum sari, ticket vaanga poradhu nee dhan!",
   "Tea master evvalavu dhan lighta tea pottalum,adhula irundhu velicham adikkadhu.",
   "Ennadhan naay'kku naalu kaal irundhalum, adhala kaal mela kaal pottu ukkara mudiyuma?",
   "Yaanai mela naama ukkandhu pona  Safari. , andha yaanai namma mela ukkandhu 'Oppari'.",
   "Kadal mela kappal pona Jolly, Kappal mela kadal pona Gaali.",
   "Oruthan evalavu dhan gunda irundhalum,avana thuppakki kulla poda mudiyaau.",
   "America naattu janadhipadhiyavae irundhalum, barber'ukku munnadi thala guninjhu dhan ukkaranum.",
"Kaal evvaluvudhan vegama odunaalum, kaikkudhan prize kadaikkum",
"Sirpi Kalla Uliyaala Adicha adhu “Kalai” Sirpiya Uliyaala Adicha adhu Kolai",
"Mandaiya Potta Die \n Mandaila Potta Dye",
"Bun mela thanni oothina enna aagum? \n Panneer agum!",
"Sigathai paarthu payapadhada miriguam edhu? \n Innoru Singam!",
"kangal pesinal KADHAL , kanneer pesinal NATPU, panam pesinal SONTHAM , ellarum pesinal ULAGAM , nee mattum pesinal LOOSU. HOW IS IT ????",
"Bus stop kitta wait panna bus varum,But full stop kitta wait panna full varuma?",
"oru kakka innoru kakkakita oru ragasiyam sollucham athu enna theriyuma? \n kaa kakka kaa kakka kaa kakka",
"kasu irunda call taxi, \n kasu illina namma kaal than taxi.",
"unkku oru maths test, \n aala mara ilai 607, \n arasa mara ilai 807 \n vepa mara ilai 89 kootina enna varum???\n ans: kuppa varum😜.",
"mottaiku helmet podalam, aanal helmetuku mottai poda mudiyma",
"Dosai mavula dosai sudalaam chapathi mavula chapathi sudalaam But, kadalai mavula kadalai suda mudiyuma",
"Muttai(Egg) idatha Paravai(Bird) ethu.?? \n ans : Aan Pravai(Male Bird).",
"Taj Mahal sollum Message enna? Sethum selavu vaippal kathali!",
"Pathu roja poova paricha oru mullu kutha dhan seyyum. Adhapola 10 figare'kku route potta, oru seruppadi vaangi than aaganum. Kathal'la idhallem sagajamppa!",
"Kappal aen aadi aadi pogudhu? Aenna adhu eppoludhum thanniyila irukku.",
"Paal eppam vetkapadum? Adhoda  aadai ya edutha pinbu.",
"professor - yenda 20 naala collegukku varala? student- enga appa eppavume solluvar  oru edathukku adikkadi pona mariyathai irukkathu'nu....",
"Akka friend’a akkaava ninaikkalam, thangachi friend’a thangachiyaa ninaikalam but…. Pondatti frienda pondattiya ninaika mudiyuma?",
"Bus'sa pinnala thalluna enna aagum? \n A: 'Pin'nnu valanju poiyidum.",
]
   
# ===========================================

ALONE_STRINGS = [
    "Sneham ariyathe pokunath.jeevith nashttam mathramanu.Enal...Athilum nashtta manu.snehikunavare.Ariyathe pokunath",
    "Jeevithathil ottapedathirikan njan avale orupad snehichu.ennal avale snehichathu karanam ellayidathum njan ottapettu",
    "Enthinayirunnu.ithellam.Urangathe avalodu samsarichu kidannathu.Bakshanam kazhikan thonnathathu.Avalude phone busy ayal hridayam thudikunnathu.   Avalodu pinangiyal mattullavarod deshyapedunnathu.  Oduval aval mattoruthante kude poyathu",
    "     .         ..",
    "Aakasham kaanikkathe..pusthakathil oliche vecha mayil peeli pole engo kalanju poya muthu.chippi pole aarum kanaathe olichu vechathaanu njan ENTE PRANAYAM",
    "polum.Yente sneham ninak sangadamanu nalgunnathengil njan maari nilkam.Karanam.Ninte sandhoshamanenik vendath.Pakshe.Nente manasu vedhanichal njan maappu kodukilla.Bhagavanu polum",
    "Orupad snehathode.Ne.yenne snehichirunnengil.nenneyorth.njan.sangadapedillayirunnu.Yennalum.Nennod yenik orupad snehama.Yente jeevanekalum",
    "Njanariyathe vidhi.eniku thanna.sammanam oru.thengalayi...Oru nertha.nombaramayi padaruna thee pole.aali kathukayanu",
    "hrudayathil orupadu vethana adakipidichu nammal chirikkan sramikku.eppozhanannariyamo.nammal snehikkunnavar namme orupadu vethanippichu mappu parayumbol",
    "     .  .......     .",
]

MULLA_STRINGS = [
    "யார்சூட மலர்ந்திருக்கின்றன விண்வெளித் தோட்டத்தில் நட்சத்திரப் பூக்கள்...!",
    "விட்டு விட்டு தான் நினைக்கிறேன்...\n விட்டு விட தான் நினைக்கிறேன்... \n ஆனாலும் என் விரல் பிடித்தே வருகிறது...\n உன் அழகான நினைவுகள்...",
    "இதழ் என்னும் மலர் கொண்டு கடிதங்கள் வரைந்தாய்.பதில் நானும் தரும் முன்பே.கனவாகி கலைந்தாய்...!",
    "நீ நடந்த பாதைகளில் நானும் நடக்கிறேன். நம் காதல் தான் ஒன்று சேரவில்லை.நம் கால் தடங்களாவது ஒன்று சேரட்டும்...!",
    "உன் முந்தானையில் ஒரு முகக்கவசம் கொடு. ஆயுள் முழுவதும்  வாழ்கிறேன் ஆக்ஸிஜன் இன்றி..",
    "அழகிய பொம்மை என நினைத்து கண் சிமிட்டாமல் பார்த்து கொண்டிருந்தேன். நீ கண் சிமிட்டிய நொடியில் கண் சிமிட்டா பொம்மையானேன் நான்...!",
    "உனக்கான இதயம் உன்னை ஒருபோதும் மறக்காது அப்படி மறந்தால் அது உனக்கான இதயமாக இருக்காது...!",
    "நினைவுகள் பல சுமக்கும் இதயம்.கனவுகள் பல காணும் மனது..நீங்காமல் அலை மோதும் நினைவு...உயிர் பிரிந்தாலும் பிரியாது உன் நினைவு",
    "ஒரு பூவாக நீ மலர்கிறாய்...ஒரு வண்டு போல் நான் நுழைகின்றேன். தேன் தேடும் வண்டுகள் போல் நான் இல்லை...நீ சம்மதம் சொல்லும் வரை...",
    "நீ நிலவும் இல்லை நட்சத்திரமும் இல்லை.இவைகளை எல்லாம் அள்ளி சூடிக்கொள்ளும் வானம் நீ...!!",
    "உன்னை உண்மையாக நேசித்த இதயத்தை விட்டு பிரிந்து விடாதே. எத்தனை இதயங்கள் உன்னை நேசித்தாலும்.அந்த ஒரு இதயம் போல் ஆகாது...",
    "உன்னை சிறைபிடிக்க நினைத்து நான் கைதி ஆனேன் உன்னிடம்.",
    "உன் கரம் பிடித்து, என் கனவுகளை நிஜமாக்கி, வாழ்ந்து மடிவதற்கு, போதாதடி இந்த ஒர் ஜென்மம். மீண்டும் ஜனனம் இருந்தால்! நீயே வேண்டும். என் உயிராக..!",
    "பக்கத்தில் நீயும் இல்லை பாவிமனம் ஏங்குதடி. வானத்தில் நீயும் நின்றால் பார்க்க விழி உயருதடி. உச்சத்தில் நீயும் வந்தாய் எந்தன் உள்ளம் ரசிக்குதடி. வெக்கத்தில் நீயும் சென்றாய் என் சின்ன இதயம் தவிக்குதடி",
    "அழகியே என் இதயத்தின் அரசியே! நீ ஆணையிட்டால் போதும், வாழ்நாள் முழுவதும் நான் உன் அடிமை என்று எழுதி தருகிறேன்.",
    "ஒரு நிமிடம் கண்களை மூடு. ஏன்? மூட சொல்கிறாய்? மூடு சொல்கிறேன். சரி மூடியாச்சு. இப்போ ஏதாவது தெரிகிறதா? இல்லை. நீ இல்லாமல் என் வாழ்வும் அப்படித்தான்",
    "அடி என்னவளே! ஏழு ஜென்மம் வாழும் ஆசையெல்லாம் இல்லையடி எனக்கு. ஓர் ஜென்மம் வாழ்ந்தாலும் அது உன்னுடன் வாழவேண்டும். அவ்வளவு தான்",
    "நீ என்னை கண்டதும் முகத்தை இருக்கமாக வைத்திருந்தாலும், என் உளவாளியான உன் கண்கள் உன் காதலை என்னிடம் சொல்லி விடுகிறது என் இனியவளே👁️👁️!",
    "புவி அசைவில் கூட தடுமாறாத நான் உன் விழி அசைவில் தடுமாறி இடம்மாறி மொத்தமாய் சாய்ந்தேனடி.",
    "என்னை பிடிக்கவில்லை என்றே சொல்லி இருக்கலாம் நீ. பிடித்திருக்கிறது என்று சொல்லி பார்க்கவும் முடியாமல் பேசவும் முடியாமல் பித்துபிடிக்க வைத்து விட்டாயடி.",
    "நீ மட்டும் போதும் என முடிவு செய்து விட்டேனடி. இனி எதை இழந்தாலும் உன்னை இழப்பதாய் இல்லை.",
    "உன்னை நினைத்து நான் எழுதும் கவிதைகள் எல்லாம் வெறும் கவிதைகள் அல்ல. நாம் காதல் கொண்டு, ஊடலும், கூடலும் இல்லாமல் பிறந்த குழந்தைகள், என் கவிதைகள்",
    "நினைவுகள் சுகமானது என்பது அனைவருக்கும் தெரியும். ஆனால்! அது கனமான ரணமானது என்பது சுமப்பவர்க்கு மட்டுமே தெரியும்.",
    "கை அளவு இதயம் தான். அதில் கடல் அளவு உன் நினைவுகள். சுமையாக அல்ல சுகமாக.",
    "அன்பு என்பது ஆகாயம் போன்றது! அதன் உச்சத்தை ஆரவாரமின்றி தொட்டவர் அம்மா  உழைப்பு என்பது கடல் போன்றது! அதன் ஆழத்தை அச்சமின்றி தொட்டவர் அப்பா! ",
    "இந்த உலகத்தில் கலப்படம் இல்லாதது எதுவென்றால்! அது தாய்ப்பாலும், தாய் பாசமும் மட்டும் தான்.!",
    "தாயைப் போல் ஒரு உறவினை தரணி எங்கும் தேடினும் கிடைத்திடுமோ! இவள் தேவதையின் மறுவடிவமன்றோ",
    "கடல் அலைக்கு எல்லை உண்டு. தாய் அன்புக்கு எல்லை உண்டோ! தாய் மடி தந்த சுகம் வேறொரு மடி தருமோ!",
    "தன்னலம் விரும்பி வாழும் உலகில், என் நலம் விரும்பி வாழும் ஓர் உயிர் 'அம்மா'.",
    "அருகில் இருக்கும் போதே அள்ளிக்கொள். தொலைந்து போன பின் தேடாதே. அது மீண்டும் கிடைக்காத பொக்கிஷம்.அன்னையின் அன்பு...!",
    " துயரம் என்பது உன்னை சிதைக்க வருவதல்ல! உன்னை சுற்றி உள்ள போலி முகங்களின் முகத்திரையை கிழிக்க வருவது! ",
    "எதிரியை காலம் கடந்தால் கூட மன்னித்து விடு. ஆனால் துரோகியை காலம் கடத்தாமல் துண்டித்து விடு. ",
    "നിന്നെ ഇതിലേറെ സ്നേഹിക്കാൻ മറ്റാർക്കെങ്കിലും കഴിയുമായിരിക്കും പക്ഷെ.... ഇതിലേറെ മറ്റൊരാളെ സ്നേഹിക്കാൻ എനിക്കാവില്ല . ❤",
]

AYINU_STRINGS = [
    "അയിന് കുയിനെന്നു പറഞ്ഞു വന്നാൽ അടിച്ചു മണ്ട പൊളിക്കും ഞാൻ 😡😡",
    "അയിന് നീ ഏതാ 😡🤭",
    "അയിന് നല്ല അടി വെച്ച് തരും ഞാൻ 🤨🤨",
    "അയിന് അങ്ങട് മാറി നിക്ക് 🤭🤭",
    "അയിന് പോയി തല കുത്തി നിക്ക് 🤭🤭",
    "അയിന് പോയി.തൂങ്ങി ചാവ് 🤭🤗",
]


@catub.cat_cmd(pattern="ayinu$", command=("ayinu", plugin_category))
async def ayinu(e):
    txt = random.choice(AYINU_STRINGS)
    await edit_or_reply(e, txt)


@catub.cat_cmd(pattern="mulla$", command=("mulla", plugin_category))
async def mulla(e):
    txt = random.choice(MULLA_STRINGS)
    await edit_or_reply(e, txt)


@catub.cat_cmd(pattern="alone$", command=("alone", plugin_category))
async def alone(e):
    txt = random.choice(ALONE_STRINGS)
    await edit_or_reply(e, txt)


@catub.cat_cmd(pattern="kozhi$", command=("kozhi", plugin_category))
async def hating(e):
    txt = random.choice(HATE_STRINGS)
    await edit_or_reply(e, txt)


@catub.cat_cmd(
    pattern="mslap(?:\s|$)([\s\S]*)",
    command=("mslap", plugin_category),
    info={
        "header": "To slap a person with random objects !!",
        "usage": "{tr}slap reply/username>",
    },
)
async def who(event):
    "To slap a person with random objects !!"
    replied_user = await get_user(event)
    if replied_user is None:
        return
    caption = await slap(replied_user, event)
    try:
        await edit_or_reply(event, caption)
    except BaseException:
        await edit_or_reply(
            event, "`Can't slap this person, need to fetch some sticks and stones !!`"
        )


async def get_user(event):
    # Get the user from argument or replied message.
    if event.reply_to_msg_id:
        previous_message = await event.get_reply_message()
        replied_user = await event.client(
            GetFullUserRequest(previous_message.sender_id)
        )
    else:
        user = event.pattern_match.group(1)
        if user.isnumeric():
            user = int(user)

        if not user:
            self_user = await event.client.get_me()
            user = self_user.id

        if event.message.entities:
            probable_user_mention_entity = event.message.entities[0]

            if isinstance(probable_user_mention_entity, MessageEntityMentionName):
                user_id = probable_user_mention_entity.user_id
                replied_user = await event.client(GetFullUserRequest(user_id))
                return replied_user
        try:
            user_object = await event.client.get_entity(user)
            replied_user = await event.client(GetFullUserRequest(user_object.id))

        except (TypeError, ValueError):
            await event.edit("`I don't slap aliens, they ugly AF !!`")
            return None
    return replied_user


async def slap(replied_user, event):
    user_id = replied_user.user.id
    first_name = replied_user.user.first_name
    username = replied_user.user.username
    if username:
        slapped = "@{}".format(username)
    else:
        slapped = f"[{first_name}](tg://user?id={user_id})"

    temp = random.choice(SLAP_TEMPLATES)

    caption = temp.format(user1=DEFAULTUSER, victim=slapped, SURID=SURID)

    return caption


@catub.cat_cmd(pattern="mrape$", command=("mrape", plugin_category))
async def raping(e):
    txt = random.choice(RAPE_STRINGS)
    await edit_or_reply(e, txt)


@catub.cat_cmd(pattern="mshe$", command=("mshe", plugin_category))
async def thanos(e):
    txt = random.choice(THANOS_STRINGS)
    await edit_or_reply(e, txt)


@catub.cat_cmd(pattern="mabuse$", command=("mabuse", plugin_category))
async def fuckedd(e):
    txt = random.choice(ABUSEHARD_STRINGS)
    await edit_or_reply(e, txt)


@catub.cat_cmd(pattern="mruns$", command=("mruns", plugin_category))
async def fuckedd(e):
    txt = random.choice(RUNSREACTS)
    await edit_or_reply(e, txt)


@catub.cat_cmd(pattern="minsult$", command=("minsult", plugin_category))
async def proo(e):
    txt = random.choice(PRO_STRINGS)
    await edit_or_reply(e, txt)


@catub.cat_cmd(pattern="foryou$", command=("foryou", plugin_category))
async def _(event):
    if event.fwd_from:
        return
    event = await edit_or_reply(event, "For you❤️...")
    await asyncio.sleep(2)
    x = random.randrange(1, 33)
    if x == 1:

        await event.edit(
            "💑ആത്മാർത്ഥ കൂടുതൽ എവിടെ കാട്ടിയോ അവിടെ നിന്നായിരിക്കും ഏറ്റവും കൂടുതൽ അവഗണന💔🚶🚶"
        )

    if x == 2:

        await event.edit(
            "നെഞ്ചിൽ ഒരു നീറ്റൽ അവശേഷിപ്പിക്കാതെ ഒരു പ്രണയവും ഇറങ്ങി പോകുന്നില്ല... അങ്ങനെ അല്ലെങ്കിൽ അത് പ്രണയവും അല്ല💘💘!"
        )

    if x == 3:

        await event.edit(
            "ചില ഇഷ്ട്ടങ്ങൾ ഉണ്ട്, ഇഷ്ട്ടപെടരുതെന്നു അറിഞ്ഞിട്ടും ഇഷ്ട്ട പെട്ടു പോയതാണ😇😇💞്..."
        )

    if x == 4:

        await event.edit(
            "സ്വന്തമെന്നു കരുതി അഹങ്കരിക്കുന്ന നിയഴലും സൂര്യന്റെ ഔദാര്യമാണ്.😅😅"
        )

    if x == 5:

        await event.edit(
            "നിന്നോട് വഴക്കിടാൻ എനിക്ക് ഇഷ്ട്ടമായിരുന്നു, അപ്പോഴെല്ലാം നിന്നോടുള്ള സ്നേഹം കൂടി വന്നു... എന്നിട്ടും നീ എന്തെ എന്നെ മനസിലാകാതെ പോയെ😪😪😪....????"
        )

    if x == 6:

        await event.edit(
            "പൊന്നിട്ട് മൂടും എന്ന് പറയുന്നില്ല.... എന്നാൽ മണ്ണിട്ട് മൂടും വരെ കൂടെ ഉണ്ടാവും..😍😍."
        )

    if x == 7:

        await event.edit(
            "കൊണ്ട് പോകുവാൻ ഒന്നുമില്ല ഈ ലോകത്ത്... കൊടുത്ത് പോവാൻ സ്നേഹവും സൗഹൃദവും മാത്രം😉😉🙃."
        )

    if x == 8:

        await event.edit(
            "നിന്നിൽ ഞാൻ ഇനിയും പെയ്യും.. നിന്നെ നനച്ചു.. നിന്റെ ആത്മാവിനെ നെഞ്ചോടു ചേർക്കും.. ഒടുവിൽ ഞമ്മൾ ഒരു മഴയായി തീരും, ഒരുമിച്ച് പെയ്യും.❣️❣️💓💕"
        )

    if x == 9:

        await event.edit(
            "കാലം എന്നെ നിനക്ക് മുന്നിൽ എത്തിച്ചു എങ്കിൽ, എന്റെ മരണം വരെ ഞാൻ നിന്റെ കൂടെ ഉണ്ടാവും നീയായി എന്നെ വെറുത്തില്ലെങ്കിൽ മാത്രം💘💘"
        )

    if x == 10:

        await event.edit(
            "എന്റെ പ്രണയം അസ്തമിക്കുകയില്ല..🌅. എന്റെ ഓർമകളുടെ ചെരുവിലെ സ്വപ്നങ്ങളും നിറങ്ങളും ഞാനും മായും വരെ..✨️✨️."
        )

    if x == 11:

        await event.edit(
            "എന്റെ ജീവിതം തുടങ്ങിയത് നിന്നോടൊപ്പം അല്ല പക്ഷെ എനിക്ക് ഉറപ്പുണ്ട് എന്റെ ജീവിതത്തിനു ഒരു അവസാനം ഉണ്ടെങ്കിൽ അത് നിന്നോട് ഒപ്പം ആയിരിക്കും, ആ അവസാന നിമിഷം വരെ ഞാൻ ഉണ്ടാവും നിന്റെ കൂടെ.💑💑.."
        )

    if x == 12:

        await event.edit(
            "നീണ്ട കാത്തിരിപ്പിന് ഞാൻ തയാറാണ് കാലമേ.. മറ്റൊരു ഹൃദയം പകരം തന്ന് തൃപ്തി പെടുത്തരുത്.. നീണ്ട മുടിയിഴകൾ വെള്ളനൂൽ ആയി മാറിയേക്കാം.. നനുത്ത വിരലുകൾ വരണ്ടു ചുളുങ്ങിയേക്കാം.. മിഴികൾ അന്ധത കൂട്ട് പിടിച്ചേക്കാം.. അപ്പോഴും എന്റെ ഹൃദയം ആ ഓർമകളിൽ ചുവന്നു താനെയിരിക്കും.. അത് കൊണ്ട് നീ എനിക്കായി എന്തെകിലും തരാൻ ബാക്കി വച്ചിട്ടുണ്ടെങ്കിൽ അവളെ തന്നെ തരിക.. എന്റെ പ്രണയത്തെ..👫👫💝"
        )

    if x == 13:

        await event.edit(
            "സ്നേഹിക്കണം, ചതിക്കുന്നവരെയല്ല അവഗണിക്കുന്നവരെയും അല്ല, ചങ്ക് പറിച്ചു തരുന്നവരെ ഞമ്മുടെ കണ്ണ് നിറഞ്ഞാൽ ഉള്ളു പിടയുന്നവരെ.💘💘."
        )

    if x == 14:

        await event.edit(
            "കാണാൻ കൊതിക്കുന്ന മുഖവും.. കേൾക്കാൻ കൊതിക്കുന്ന ശബ്ദവും ഒരുപാട് അകലെ ആയിരിക്കുമ്പോൾ, സ്നേഹം ഒരു നൊമ്പരം മാത്രമാണ്.💔💔💔."
        )

    if x == 15:

        await event.edit(
            "തിരക്ക് ഇല്ലങ്കിലും ചിലർ തിരക്കിൽ ആയിരിക്കും, എങ്ങനെ എങ്കിലും ഞമ്മുടെ മുന്നിൽ നിന്നും ഒഴിഞ്ഞു മാറി നിൽക്കാൻ.😣😣😣😖."
        )

    if x == 16:

        await event.edit(
            "ജീവിതത്തിന്റെ ഇരുൾ അടഞ്ഞ വഴികളിലൂടെ ഒറ്റയ്ക്കു നടക്കുമ്പോൾ ചേർത്ത് പിടിക്കാൻ കിട്ടുന്ന കൈകളുടെ കരുത്ത് നോക്കാറില്ല ആരും.🤝🤝👫👬👭."
        )

    if x == 17:

        await event.edit(
            "ഒരു പെൺകുട്ടി ആത്മാർഥമായി നിങ്ങളെ പ്രണയിക്കുന്നുണ്ടെങ്കിൽ.. അവൾ നിങ്ങളോട് ഒരുപാട് കാര്യങ്ങൾക് ദേഷ്യപ്പെടും💑❣️.."
        )

    if x == 18:

        await event.edit(
            "നടക്കില്ല നടക്കില്ല എന്ന് വിചാരിച്ചാൽ ലോകത്ത് ഒരു കാര്യാവും നടക്കില്ല.. എന്നാൽ നടക്കും നടക്കും എന്ന് വിചാരിച്ചിട്ടിറങ്ങിയാൽ നടക്കാതെ കാര്യവും ഇല്ലാ 😅😇.."
        )

    if x == 19:

        await event.edit(
            "മനസ് വിതുമ്പുന്ന സമയത്തും ചിരിക്കാൻ കഴിയുന്നത് ഭാഗ്യമാണ്, ഒരു വരദാനമാണ്.☺️☺️.. ഒന്നും ഇല്ലാത്തവർക്ക് ദൈവത്തിന്റെ സമ്മാനമാണ് അങ്ങനെ ചിരിക്കാൻ ഉള്ള കഴിവ്.☺️☺️😇."
        )

    if x == 20:

        await event.edit(
            "കൈ തട്ടി ഫോണിലോട്ടു നോക്കിയപ്പോൾ ഒരു മൊഞ്ചുള്ള മുഖം, അപ്പൊ മനസിലായി കൈ തട്ടി ഫ്രണ്ട് ക്യാമറ ഓൺ ആയതാണെന്നു..🙈🙈🙈"
        )

    if x == 21:

        await event.edit(
            "ജീവിതത്തിൽ ആരെയും വിലകുറച്ചു കാണരുത്. ഓർക്കുക, നിലച്ചു പോയ ഘടികാരവും ദിവസത്തിൽ രണ്ടു പ്രാവിശ്യം യഥാർത്ഥ സമയം കാണിച്ച് തരുന്നു.⌚️⌚️. "
        )

    if x == 22:

        await event.edit(
            "ആരെയും പരിഹസിക്കരുത് സ്വന്തം സുഹൃത്തായാൽപോലും.. ന്യൂനതകൾ ഇല്ലാത്ത മനുഷ്യർ ഇല്ല.. എല്ലാം തികഞ്ഞവരായി മനുഷ്യനെ സൃഷ്ടിച്ചിട്ടുമില്ല..💞☺️"
        )

    if x == 23:

        await event.edit(
            "നിന്നെ പരിചയപെട്ടപ്പോഴോ.. നിന്നോട് സംസാരിച്ചു തുടങ്ങിയപ്പോഴോ ഞാൻ അറിഞ്ഞില്ല.. നീയെന്റെ ഹൃദയത്തിലോട്ട് ഒരു ടിക്കറ്റ് എടുക്കുമെന്ന് ഈ ടിക്കറ്റ് വച്ച് അടുത്ത സ്റ്റോപ്പിൽ ആണോ.. അതോ അവസാന സ്റ്റോപ്പിൽ ഇറങ്ങുക, അത് വ്യക്തമല്ല.. എന്നാലും ഞാൻ നിന്നെ ഒരുപാട് സ്നേഹിക്കുന്നു..😇💓💖"
        )

    if x == 24:

        await event.edit(
            "എന്റെ സ്വപ്നങ്ങളിൽ നിറയുന്നത് നിന്റെ മുഖം മാത്രം.. നീ എനിക്ക് എന്ത്ര പ്രിയ പെട്ടതാണെന്ന് പറയാൻ എനിക്ക് വാക്കുകൾ ഇല്ല.. എന്ത്ര കാലം വേണമെങ്കിലും കാത്തിരിക്കാം ഞാൻ.. നീ എന്റേത്‌ മാത്രമാവുന്ന നിമിഷത്തിനായി💘💘.."
        )

    if x == 25:

        await event.edit(
            "ഓരോ യാത്രയിലും അറിയാതെ നിന്നെ തിരയുന്നു ഞാൻ.. കൈവിട്ടു പോയ നിന്റെ കൈകളെ.. നിന്റെ ഓർമകളെ.💔☹️☹️😢."
        )

    if x == 26:

        await event.edit("നിന്റെ ഇഷ്ട്ടങ്ങൾ തേടി എന്റെ ഇഷ്ടങ്ങൾ എല്ലാം നീയായി.❤️❤️..")

    if x == 27:

        await event.edit(
            "ആകാശത്തിലെ നക്ഷത്രങ്ങളെയും, കടൽ തീരത്തെ മണൽ തരികളെയും എന്ന് ഞാൻ എണ്ണി തീർക്കുന്നോ അന്ന് ഞാൻ നിന്നെ മറക്കും.💘💘❤️❤️.."
        )

    if x == 28:

        await event.edit(
            "മറക്കാൻ വയ്യ എന്ന് പറഞ്ഞ പലർക്കും ഇപ്പോൾ ഞമ്മളെ ഓർക്കാൻ വയ്യ എന്നാ അവസ്ഥയിലായി😊😊😊..."
        )

    if x == 29:

        await event.edit(
            "ചിലർക്ക് ഞമ്മളാണ് ഏറ്റവും പ്രിയപ്പെട്ടത് എന്ന് കരുതുന്നുവെങ്കിലും...... അവർക്ക് പ്രിയം ഞമ്മളെ കാൾ മറ്റുള്ളവരോടാണ്, എന്നാ തിരിച്ചറിവ്.... വല്ലാത്ത നൊമ്പരം തന്നെയാണ്................ എന്നും.......... എപ്പോഴും 😊😊😭😭......."
        )

    if x == 30:

        await event.edit(
            "ഒരു പ്രണയം ഉണ്ടായിരുന്നു അത് ഞാൻ പഠിക്കാതെ എഴുതിയ പരീക്ഷ പോലെ തോറ്റു പോയി. കുറച്ച് ഓർമ്മകൾ ഉണ്ടായിരുന്നു അത് ഞാൻ ദൂരെ കടലിൽ ഒഴുകി കളഞ്ഞിട്ടും വീണ്ടും മഴയായി അത് എന്റെ മേൽ പെയ്യുന്നു. പിന്നെ ഉള്ളത് അല്പം വേദനയാണ്, അത് അണയാതെ, കളയാതെ ഒരു കനലായി നോവായി മനസ്സിൽ ഇപ്പോഴും കൊണ്ട് നടക്കുന്നു.🚶‍♂️🚶‍♂️."
        )

    if x == 31:

        await event.edit(
            "ദിവസവും ഒരുപാട് പെൺകുട്ടികളെ കാണാറുണ്ട്, അവരോട് ആരോടും ഇത് വരെ ഒരു ഇഷ്ട്ടം തോന്നിട്ടില്ല. കാരണം, എന്റെ പെണ്ണിന് എന്നിലൊരു വിശ്വാസമുണ്ട്. അത് തകർക്കാൻ എനിക്ക് ഈ ജന്മം കഴിയില്ല❤️❤️💘.."
        )

    if x == 32:

        await event.edit(
            "സ്നേഹം... അത് കൈകുമ്പിളിൽ കോരി എടുക്കാനോ തട്ടി എടുക്കാനോ കഴിയില്ല, അത് ഹൃദയത്തിൽ നിന്നും ഹൃദയത്തിലേക്കു പകർന്നു നൽകുവാനേ കഴിയു.❤️❤️😇."
        )

    if x == 33:

        await event.edit(
            "എന്റെ ഹൃദയത്തിൽ ചുവന്ന റോസാപുഷ്പ്പങ്ങൾ വളരുന്നുണ്ട്. പക്ഷെ, അവ ഒരിക്കലും കൊഴിയാറില്ല. കാരണം, ഞാൻ നിന്റെ പുഞ്ചിരി കാണുമ്പോഴും നിന്നെ കുറിച്ച് ചിന്തിക്കുമ്പോഴുമെല്ലാം അവ വിടരുന്നു☺️☺️.."
        )


@catub.cat_cmd(pattern="msing$", command=("msing", plugin_category))
async def _(event):
    if event.fwd_from:
        return
    event = await edit_or_reply(event, "Singing...")
    await asyncio.sleep(2)
    x = random.randrange(1, 44)
    if x == 1:
        await event.edit(
            "🎶 ഒരുനാൾ തരളമിവനിൽ... പടരൂ വനലതികയായ്... മുറുകെ... മതിവരുവോളം സഖീ... 🎶"
        )
    if x == 2:
        await event.edit(
            "🎶 അഴലിന്റെ ആഴങ്ങളിൽ അവൾ മാഞ്ഞുപോയ്... നോവിന്റെ തീരങ്ങളിൽ ഞാൻ മാത്രമായ്... 🎶"
        )
    if x == 3:
        await event.edit(
            "🎶 ആവണിപ്പൊന്നൂഞ്ഞാലാടിക്കാം നിന്നെ ഞാൻ... ആയില്ല്യം കാവിലെ വെണ്ണിലാവേ... 🎶"
        )
    if x == 4:
        await event.edit(
            "🎶 ഇന്ദ്രനീലിമയോലും ഈ മിഴി പൊയ്കകളിൽ... ഇന്നലെ നിൻ മുഖം നീ നോക്കി നിന്നൂ... 🎶"
        )
    if x == 5:
        await event.edit("🎶 മയിലായ് പറന്നുവാ മഴവില്ലു തോൽക്കുമെന്നഴകേ... 🎶")
    if x == 6:
        await event.edit(
            "🎶 നിലാവിന്റെ നീലഭസ്മ കുറിയണിഞ്ഞവളേ... കാതിലോലക്കമ്മലിട്ടു കുണുങ്ങി നിന്നവളേ... 🎶"
        )
    if x == 7:
        await event.edit("🎶 നീയൊരു പുഴയായ് തഴുകുമ്പോൾ ഞാൻ പ്രണയം വിടരും കരയാവും... 🎶")
    if x == 8:
        await event.edit(
            "🎶 അരികിൽ നീയുണ്ടായിരുന്നെങ്കിലെന്നു ഞാൻ... ഒരുമാത്ര വെറുതേ നിനച്ചുപോയി... 🎶"
        )
    if x == 9:
        await event.edit(
            "🎶 എത്രയോ ജന്മമായ് നിന്നെഞാൻ തേടുന്നു... അത്രമേൽ ഇഷ്ടമായ് നിന്നെയെൻ പുണ്യമേ... 🎶"
        )
    if x == 10:
        await event.edit(
            "🎶 മഴത്തുള്ളികൾ പൊഴിഞ്ഞീടുമീ നാടൻ വഴി... നനഞ്ഞോടിയെൻ കുടക്കീഴിൽ നീ വന്ന നാൾ... 🎶"
        )
    if x == 11:
        await event.edit(
            "🎶 കരളേ നിൻ കൈ പിടിച്ചാൽ, കടലോളം വെണ്ണിലാവ്... ഉൾക്കണ്ണിൻ കാഴ്ചയിൽ നീ, കുറുകുന്നൊരു വെൺപിറാവ്... 🎶"
        )
    if x == 12:
        await event.edit(
            "🎶 മറന്നിട്ടുമെന്തിനോ മനസ്സിൽ തുളുമ്പുന്നു മൗനാനുരാഗത്തിൻ ലോലഭാവം... 🎶"
        )
    if x == 13:
        await event.edit("🎶 മഴക്കാലം എനിക്കായി മയിൽ ചെലുള്ള പെണ്ണേ നിന്നെത്തന്നേ... 🎶")
    if x == 14:
        await event.edit(
            "🎶 മിഴിയറിയാതെ വന്നു നീ മിഴിയൂഞ്ഞാലിൽ... കനവറിയാതെയേതോ കിനാവു പോലെ... 🎶"
        )
    if x == 15:
        await event.edit("🎶 ചന്ദനച്ചോലയിൽ മുങ്ങിനീരാടിയെൻ ഇളമാൻ കിടാവേ ഉറക്കമായോ... 🎶")
    if x == 16:
        await event.edit("🎶 കറുത്തപെണ്ണേ നിന്നെ കാണാഞ്ഞിട്ടൊരു നാളുണ്ടേ... 🎶")
    if x == 17:
        await event.edit(
            "🎶 താമരപ്പൂവിൽ വാഴും ദേവിയല്ലോ നീ... പൂനിലാക്കടവിൽ പൂക്കും പുണ്യമല്ലോ നീ... 🎶"
        )
    if x == 18:
        await event.edit("🎶 പാടം പൂത്തകാലം പാടാൻ വന്നു നീയും... 🎶")
    if x == 19:
        await event.edit("🎶 രാജഹംസമേ മഴവിൽ കുടിലിൽ... സ്നേഹദൂതുമായ് വരുമോ... 🎶")
    if x == 20:
        await event.edit(
            "🎶 പത്തുവെളുപ്പിന് മുറ്റത്തു നിക്കണ കസ്തൂരി മുല്ലയ്ക്ക് കാത്തുകുത്ത്... എന്റെ കസ്തൂരി മുല്ലയ്ക്ക് കാത്തുകുത്ത്... 🎶"
        )
    if x == 21:
        await event.edit(
            "🎶 മഞ്ഞൾ പ്രസാദവും നെറ്റിയിൽ ചാർത്തി... മഞ്ഞക്കുറിമുണ്ടു ചുറ്റി... 🎶"
        )
    if x == 22:
        await event.edit(
            "🎶 അന്തിപ്പൊൻവെട്ടം കടലിൽ മെല്ലെത്താഴുമ്പോൾ... മാനത്തെ മുല്ലത്തറയില് മാണിക്യച്ചെപ്പ്... 🎶"
        )
    if x == 23:
        await event.edit(
            "🎶 അമ്പലപ്പുഴെ ഉണ്ണിക്കണ്ണനോടു നീ... എന്തുപരിഭവം മെല്ലെയോതിവന്നുവോ... 🎶"
        )
    if x == 24:
        await event.edit(
            "🎶 കുടജാദ്രിയിൽ കുടചൂടുമാ കോടമഞ്ഞുപോലെയീ പ്രണയം... തഴുകുന്നു, എന്നെ പുണരുന്നു... 🎶"
        )
    if x == 25:
        await event.edit("🎶 ശ്യാമാംബരം പുൽകുന്നൊരാ വെൺചന്ദ്രനായ് നിൻ പൂമുഖം... 🎶")
    if x == 26:
        await event.edit("🎶 ശ്രീരാഗമോ തേടുന്നിതെൻ വീണതൻ പൊൻ തന്ത്രിയിൽ... 🎶")
    if x == 27:
        await event.edit(
            "🎶 എന്തിനു വേറൊരു സൂര്യോദയം... നീയെൻ പൊന്നുഷസ്സന്ധ്യയല്ലേ... 🎶"
        )
    if x == 28:
        await event.edit("🎶 അനുരാഗിണീ ഇതായെൻ കരളിൽ വിരിഞ്ഞ പൂക്കൾ... 🎶")
    if x == 29:
        await event.edit("🎶 പാടാം നമുക്കു പാടാം... വീണ്ടുമൊരു പ്രേമഗാനം... 🎶")
    if x == 30:
        await event.edit(
            "🎶 അല്ലിമലർ കാവിൽ പൂരം കാണാൻ... അന്നു നമ്മൾ പോയി രാവിൽ നിലാവിൽ... 🎶"
        )
    if x == 31:
        await event.edit(
            "🎶 കറുകവയൽ കുരുവീ... മുറിവാലൻ കുരുവീ... തളിർ വെറ്റിലയുണ്ടോ... വരദക്ഷിണ വെക്കാൻ... 🎶"
        )
    if x == 32:
        await event.edit(
            "🎶 കുന്നിമണിച്ചെപ്പു തുറന്നെണ്ണി നോക്കും നേരം, പിന്നിൽവന്നു കണ്ണു പൊത്തും കള്ളനെങ്ങു പോയി... 🎶"
        )
    if x == 33:
        await event.edit(
            "🎶 നാടോടി പൂന്തിങ്കൾ മുടിയിൽ ചൂടി നവരാത്രി പുള്ളോർക്കുടമുള്ളിൽ മീട്ടി കണിക്കൊന്നപ്പൂ മണിക്കമ്മലണിഞ്ഞും പുളിയിലക്കര കസവുമുണ്ടുടുത്തും പുഴയിന്നൊരു നാടൻ പെണ്ണായോ... 🎶"
        )
    if x == 34:
        await event.edit(
            "🎶 നീ കണ്ണോട് കണ്ണോട് കണ്ണോരമായ് കാതോട് കാതോട് കാതോരമായ് നെഞ്ചോട് നെഞ്ചോട് നെഞ്ചോരമായ് നിറയേ....🎶"
        )
    if x == 35:
        await event.edit(
            "🎶 എള്ളോളം തരി പൊന്നെന്തിനാ തനി തഞ്ചാവൂര് പട്ടെന്തിനാ തങ്കം തെളിയണ പട്ടു തിളങ്ങണ ചന്തം നിനക്കാടീ... 🎶"
        )
    if x == 36:
        await event.edit(
            "🎶 പൂമുത്തോളെ നീയെരിഞ്ഞ വഴിയില്‍ ഞാന്‍മഴയായി പെയ്തെടീ... ആരീരാരം ഇടറല്ലേ മണിമുത്തേ കണ്മണീ... മാറത്തുറക്കാനിന്നോളം തണലെല്ലാം വെയിലായി കൊണ്ടെടീ... മാനത്തോളം മഴവില്ലായ്‌ വളരേണം എന്‍ മണീ ..🎶"
        )
    if x == 37:
        await event.edit(
            "🎶 നീ ഹിമമഴയായ് വരൂ... ഹൃദയം അണിവിരലാൽ തൊടൂ... ഈ മിഴിയിണയിൽ സദാ പ്രണയം മഷിയെഴുതുന്നിതാ... ശിലയായി നിന്നിടാം നിന്നെ നോക്കീ യുഗമേറെയെന്റെ കൺചിമ്മിടാതെ... എൻജീവനേ......🎶"
        )
    if x == 38:
        await event.edit(
            "🎶 ലല്ലലം ചൊല്ലുന്ന ചെല്ലകിളികളേ വേടന്‍ കുരുക്കും കടങ്കഥ ഇക്കഥ ഇക്കഥയ്ക്കുത്തരം തേടുവാന്‍ കൂടാമോ.. ഇല്ലെങ്കില്‍ സുല്ലെങ്കില്‍ ഇല്ലില്ല സമ്മാനം...🎶"
        )
    if x == 39:
        await event.edit("🎶 സുന്ദരീ സുന്ദരീ ഒന്നൊരുങ്ങി വാ നാളെയാണ് താലി മംഗലം.... 🎶")
    if x == 40:
        await event.edit(
            "🎶 തൂമിന്നൽ തൂവൽ തുമ്പാൽ മെല്ലെ എൻ പൂവൽ കനവിൽ തഴുകാൻ വരൂ... വാർതിങ്കൾ മായും രാവിൻ കൊമ്പിൽ ചിറകേറി നീ പുലർ വെയിൽ മലർ തരൂ...🎶"
        )
    if x == 41:
        await event.edit("🎶 ജീവാംശമായ് താനേ നീ എന്നിൽ കാലങ്ങൾ മുന്നേ വന്നൂ ...🎶")
    if x == 42:
        await event.edit("🎶 ചന്ദനക്കുറി നീയണിഞ്ഞതിലെന്റെ പേര് പതിഞ്ഞില്ലേ.... 🎶")
    if x == 43:
        await event.edit(
            "🎶 ആവണിപ്പൊന്നൂഞ്ഞാലാടിക്കാം നിന്നെ ഞാൻ ആയില്യം കാവിലെ വെണ്ണിലാവേ പാതിരാമുല്ലകൾ താലിപ്പൂ ചൂടുമ്പോൾ പൂജിക്കാം നിന്നെ ഞാൻ പൊന്നു പോലെ...🎶"
        )
    if x == 44:
        await event.edit(
            "🎶 പണ്ടു പണ്ടേ പൂത്ത മലരുകൾ മിന്നും മിന്നാമിനുങ്ങുകൾ ഒരു കുറി ഇനി വരുമോ...🎶"
        )